In [5]:
import pandas as pd

df = pd.read_csv('sales.csv', index_col = 'month')
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [6]:
df['salt']['Jan']

12.0

In [7]:
df.eggs['Mar']

221

In [9]:
df.salt['Jan']

12.0

In [11]:
## Using the .loc accessor
print(df)

df.loc['May','spam']

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

52

In [16]:
## Using the .iloc accessor
print(df)

df.iloc[4,2]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

52

In [18]:
### Selecting only columns

df_new = df[['salt','eggs']]
df_new

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

In [20]:
###### Slicing DataFrames

df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [21]:
### Slicing and indexing the series

df['eggs'][1:4]

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [22]:
df['eggs'][4]

132

In [23]:
#### Using .loc[]
df.loc[:, 'eggs':'salt']  ## select all rows and some column

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [24]:
df.loc['Jan':'Apr',:]  # Some rows, all columns

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20

In [25]:
df.loc['Mar':'May','salt':'spam']

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

In [27]:
### Using .iloc
print(df)
df.iloc[2:5,:]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

In [28]:
### Using list rather than slices

df.loc["Jan": 'May', ['eggs', 'spam']]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52

In [32]:
df
df.iloc[[0,4,5], 0:2]

       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0